<?php 

<?php

namespace App\Http\Controllers;

use Illuminate\View\View;

// Import View for proper return type

class CourseDetailsController extends Controller
{
    public function show($classname = null)
    {
        // Your course data array
        $courseData = [

            [
                'course_name' => 'ڈیپلومہ کورسس',
                'classes' => [
                    [
                        'id' => 1,
                        'class_name' => 'درس نظامی',
                        'contact' => '+923171186816',
                        'description' => 'وفاق المدارس العربیہ پاکستان کے تحت خواتین و طالبات کے لئے چھ سال پر مشتمل درس نظامی عالمہ کورس، درس نظامی کو رس کے تین لیول ہیں، ہر لیول کا دورانیہ دو سال ہے، دینی و معاشرتی تربیت کے حوالے سے ہر طالبہ کو انفرادی و خصوصی توجہ دی جائے گی، طالبات کی شخصیت کو سنت نبوی صلی اللہ علیہ وآلہ وسلم کی روشنی میں سنوارا جائے گا',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'درس نظامی کے ایک کورس سے رکھی گئی بنیاد جلد ہی اسپیشلائزیشن کورسز تک کا بہترین گلدستہ بن گیا، اور ای الکہف فارسسٹر ز عالمی شہرت کی حامل بہترین
                        دینی درسگاہ بن گئی۔
                        درس نظامی چھ سالہ کورس کو وفاق المدارس العربیہ کے نصاب پر رکھا گیا، جس میں ہر سال ہزاروں کی تعداد میں طلباء و طالبات سند فراغت حاصل کر رہی ہیں، اور ای الکہف فار سسٹرز کے پہلے بیچ نے 2022ء میں الحمد للہ وفاق کی جانب سے سند فراغت حاصل کی اور اب عملی میدان میں کام کر رہی
                        ہیں۔',
                        'fee' => '2500',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday',
                        'time' => '10 AM TO 1 PM',
                        'image_url' => 'images/courselist/diploma/1.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'خاصہ اول',
                                'books' => ['تفسیر عم پارہ مکمل', 'آسان تجوید', 'جوامع الکلم+ زاد الطالبین', 'علم الصرف', 'علم النحو', 'طریقۃ العصریہ+ عوامل النحو', 'تعلیم الاسلام +تاریخ الاسلام', 'عربی کا معلم'],
                            ],
                            [
                                'subject_name' => 'خاصہ ثانی',
                                'books' => ['تفیسر القرآن ( سورۃ یونس تا سورۃ عنکبوت)', 'علم الصیغہ', 'المختصر القدروی', 'اصول فقہ', 'اصول الشاشی', 'ہدایۃ النحو', 'شرح مائتہ عوامل', 'تیسیر المنطق'],
                            ],
                            [
                                'subject_name' => 'عالیہ اول',
                                'books' => ['تفسیر القرآن سورۃ( روم تا سورۃ تحریم)', 'ریاض الصالحین', 'المختصر القدوری', 'علم المیراث', 'دروس البلاغۃ', 'نورالانوار', 'مختارات', 'عقیدۃ الطحاویہ'],
                            ],
                            [
                                'subject_name' => 'عالیہ ثانی',
                                'books' => ['تفسیر القرآن ( سورۃ فاتحہ تا سورۃ توبہ)', 'مشکوۃ شریف جلد اول', 'مشکوۃ جلد ثانی', 'ہدایہ جلد اول', 'خیر الاصول', 'علوم القرآن', 'شرح عقائد', 'تربیت اولاد'],
                            ],
                            [
                                'subject_name' => 'عالمیہ اول',
                                'books' => ['جلالین شریف جلد اول', 'سنن ابوداؤد جلد اول', 'جامع ترمذی جلد ثانی', 'تیسیر المصطلح الحدیث', 'طحاوی شریف', 'ہدایہ جلد ثانی', 'آئینہ قادیانیت'],
                            ],
                            [
                                'subject_name' => 'عالمیہ ثانی',
                                'books' => ['صحیح بخاری جلد اول', 'صحیح بخاری جلد ثانی', 'صحیح مسلم جلد اول', 'صحیح مسلم جلد ثانی', 'جامع ترمذی جلد اول', 'سنن ابوداؤد جلد ثانی', 'شمائل ترمذی'],
                            ],
                        ],
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ]
                    , [
                        'id' => 2,
                        'class_name' => 'دراسات دینیہ',
                        'contact' => '+923331254560',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => ' ادارے کی ایک اور کاوش ان خواتین کیلئے ہے جو زیادہ وقت پڑھائی کو نہیں دے سکتیں لیکن طلب  ضرور رکھتی ہیں۔۔۔ان کیلئے 2022ء سے ہی جز وقتی دوسالہ عالمات کورس کی ترتیب رکھی گئی جوکہ وفاق المدارس العربیہ کے زیرِ اہتمام کروایا جارہا ہے اور اس میں پاکستان اور بیرون ممالک کی طالبات شامل ہوتی ہیں۔
                        مختصر تفسیر، حدیث، عربی علوم سے طالبات کی مناسبت کروائی جاتی ہے، اس مختصر دورانیہ میں ہونے والے کورس کا مقصد ان خواتین کی حوصلہ افزائی اور ضروری دینی علوم سے آگہی ہے جو طویل کورسز میں کچھ ہچکچاہٹ کا شکار ہوتی ہیں تو دو سالہ جامع کورس ایسی خواتین کے لیے گوہر نایاب سے کم نہیں۔
                        ',
                        'description' => '◀️ اساتذہ کی مکمل نگرانی
                                          ◀️ اسباق کی ریکارڈنگ کی فراہمی
                                          ساتھ ساتھ
                                          ◀️ اخلاقی و روحانی ورکشاپس
                                          ◀️ ذہنی سکون کے موافق مختلف ورکشاپس
                                          ◀️ الغزو الفکری (ففتھ جنریشن وار) و تاریخِ اسلامی سے آگاہی',
                        'fee' => '2500',
                        'time' => '3 pm to 6 pm',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'image_url' => 'images/courselist/diploma/2.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'سالِ اول',
                                'books' => [
                                    'تفسیر (سورہ یونس پ۱۱ تا سورہ عنکبوت پ۲۱)',
                                    'معارف الحدیث (جلد ۲,۳,۴)',
                                    'تعلیم الاسلام (مفتی کفایت اللہ نور اللہ مرقدہ)',
                                    'بہشتی زیور قدیم (حصہ ۲,۳,۴) (مولانا اشرف علی تھانوی رحمہ اللہ)',
                                    'قصص النبیین (۱,۲)',
                                    'سیرتِ خاتم الانبیاء صلی اللہ علیہ وسلم',
                                    'علم الصرف (اولین)',
                                    'علم النحو',
                                    'الطریقۃ العصریۃ (اول)',
                                ],
                            ],
                            [
                                'subject_name' => 'سالِ دوم',
                                'books' => [
                                    'ترجمہ و تفسیر (مابقیہ قرآن کریم)',
                                    'معارف الحدیث (جلد ۱,۵,۶,۷)',
                                    'بہشتی زیور قدیم (حصہ ۵,۶,۷) (مولانا اشرف علی تھانوی رحمہ اللہ)',
                                    'قصص النبیین (۳,۴)',
                                    'علم الصرف (آخرین)',
                                    'عوامل النحو',
                                    'الطریقۃ العصریۃ (دوم)',
                                    'حیات المسلمین',
                                ],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 3,
                        'class_name' => 'تخصص فی التفسیر',
                        'contact' => '+923363597816',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'یہ ایک سالہ قرآنک ایجوکیشن میں اسپیشلائزیشن ہے جس میں قرآنی علوم و فنون کے ماہر اور وسیع تجربہ رکھنے والے علماء کرام کی زیر نگرانی چودہ سو سالہ تفسیری علمی تراث سے بھرپور شناسائی اور واقفیت دلوائی جاتی ہے امت کے عروج و زوال کی تمام کڑیاں قرآن کریم سے وابستگی و عدم وابستگی سے جڑتی ہیں یہ کورس دراصل اسی سلسلہ کی اہم ترین کاوش ہے جس کا مقصد ایک ایسی جماعت تیار کرنا ہے جو قرآن کریم کے درست مطالب و معانی عام فہم اور سادہ و سلیس انداز اور صحیح تعبیر و الفاظ میں عوام تک پہنچائیں اور انہیں پیغامِ الٰہی اور پیغاماتِ وحی سے آگاہ کریں، جو قرآنی مفاہیم کو سنتِ طیبہ، آثارِ صحابہ، اجماع امت اور فہمِ سلف کی روشنی میں اگلی نسل تک منتقل کریں۔',
                        'description' => '
                        صرف عالمات فاضلات کے لئے ،
                        📝 موضوعات قرآنی پر ماہرین کی نگرانی میں ریسرچ
                        📝 اساتذہ کی رہنمائی میں قدیم و جدید تفاسیر کا مطالعہ
                        📝 قدیم و جدید تفاسیر سے محققانہ آگاہی اور استفادہ کا طریقہ
                        📝 درس قرآن کی عملی مشق
                        📝 کتب کا تعارف
                        📝 معاصر مفسرین سے آگاہی
                        📝 انگلش اور کمپیوٹر کے بنیادی کورسز پر خصوصی توجہ
                        📝 ٹریننگز اینڈ ورکشاپس
                        📝 پروفیشنل ڈیویلیپمنٹ',
                        'fee' => '2500',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'تخصص فی التفسیر کا وقت',
                        'image_url' => 'images/courselist/diploma/3.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'عنوانات',
                                'books' => ['علوم القرآن کے اہم مباحث', 'اصول التفسیر و قواعد التفسیر', 'احکام القرآن', 'بلاغت القرآن کی عملی مشق', 'اعجاز القرآن اور مستشرقین', 'قصص القرآن و قرآنی جغرافیہ', 'رسم عثمانی کا تعارف و اہمیت', 'قراءات متواترہ کا تعارف و اہمیت', 'درس قرآن کی عملی مشق', 'قدیم و جدید مفسرین کا اسلوب و منھج', 'تجوید القرآن کی عملی مشق', 'اعراب القرآن'],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 4,
                        'class_name' => 'تخصص فی الافتاء',
                        'contact' => '+923363597816',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'تخصص فی الافتاء ایک سالہ  کورس ہے جس میں باصلاحیت عالمات کو ماہرینِ فن مفتیان کرام  کی زیر نگرانی صحیح اصول اور قواعد فقہیہ کی روشنی میں عمدہ، بہترین اور منفرد انداز میں مسائل کی مشق کرائی جاتی ہے نیز جدید تقاضوں،نت نئے مسائل اور معاشرے کی زبان و انداز اور عرف و رواج سے متعارف کرایا جاتا ہے،مقاصد میں سے ایک مقصد یہ بھی ہے کہ معاشرے کو ایسی ماہر عالمات مفتیہ خواتین فراہم کرنا جو ان کے عقائد و نظریات،عبادات و اخلاق سے لے کر معاشرت و معاملات اور تجارت تک میں ان کی صحیح دینی فقہی شرعی راہنمائی کریں اور مستورات کے مسائل میں بطور خاص ان کے لیے آسانی اور سہولت ہو اور مرد حضرات کے بجائے مستورات ہی ان مسائل کو اچھی طرح حل کرنے کی صلاحیت رکھتی ہو۔',
                        'description' => '٠آداب تحریر،  اصول افتاء اور تمرين افتاء پرخصوصی توجہ
                        •50 تخریجات سمیت 100 فتاوی اور مسائل میراث بمع عملی مشق
                        * منفرد اور خصوصی انداز میں فتاوی کی تصحیح و تنقیح
                        * مصادر و مآخذ کا تعارف
                        * اکابر فقہاء کا منہج افتاء
                         اور ان کے فتاوی و فقہی تحقیقات کا تعارف
                        * تدریس کتب فقہ کا طریقہ و مشق
                        ٠ قواعد فقہیہ، فقہ البیوع اور المعاییر الشرعیہ کی باقاعدہ تدریس
                        * علم فقہ میں رسوخ
                        * فقہاء کرام کا تعارف اور ان کے تخریج مسائل میں وجوہ فرق
                        ٠ فلکیات،  تخریج اوقات صلوة ، سمت قبلہ ، رؤیت ہلال کی تدریس و عملی مشق
                        ٠ جدید معیشت و تجارت ، اسلامک بینکنگ حلال سرٹیفیکیشن اور تکافل کا تعارف
                        ٠ دوران سال مختلف جدید موضوعات پر شارٹ کورسز
                        ٠ کمپیوٹر کورسز (ایم ایس آفس، ایکسل، پاور پوائنٹ فوٹو شاپ اور کورل ڈرا )

                        ٠ ڈیجیٹل لائبریریز ( مکتبہ شاملہ مکتبہ جبریل ، خادم الحرمین ، مکنون وغیرہ) کا طریقہ استعمال',
                        'fee' => '2500',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'تخصص فی الافتاء کا وقت',
                        'image_url' => 'images/courselist/diploma/4.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'نصاب',
                                'books' => [
                                    'شرح عقود رسم المفتی',
                                    'مقدمۃ شامیۃ',
                                    'اصول الافتاء و آدابہ',
                                    'آدابِ فتویٰ نویسی',
                                    'تمرین افتاء کی ھدایات',
                                    'قواعد فقہیہ',
                                    'السراجی فی المیراث',
                                    'الاشباہ والنظائر',
                                    'الحیلۃ الناجزۃ للحلیلۃ العاجزۃ',
                                    'فقہ البیوع',
                                    'تاریخ فقہ و مذاہب فقہیہ',
                                    'امداد الفتاویٰ',
                                    'تعارف مصادر و کتب فقہ',
                                    'جدید فقہی مسائل و نازل کا حل و منہج',
                                    'مطالعاتی کتب فقہ( شامی ، عالمگیری ، فتاوی عثمانی)',
                                    'ارشاد الطالب لما فی الھدایہ من المطالب',
                                    'جواہر الفقہ منتخبات دیگر کتب مفتی محمد شفیع صاحب',
                                ],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],
                            [
                                'text' => "چمن تو بہت دیکھے لیکن الکہف جیسا نرالا نہیں، جہاں شفقت ومحبت،ادب واحترام، اپنائیت کے ماحول میں ان کنتم خیر امۃ کی عملی تصویر اساتذہ و معلمات تعلیم کے ساتھ ساتھ  اسوۃ حسنۃ سے مزین شب و روز طالبات کو علم سے آراستہ کرنے، نکھارنے میں دل و جان سے مصروف وہ بھی بغیر تھکے بغیر رکے پرخلوص۔
                            لگتا ہے جیسے صحابہ کا دور لوٹ آیا جہاں علم کے پیاسے علم کے ساتھ عمل و اصلاح نفس کی خاطر من جد وجد کی فکر میں صراط مستقیم کے راہی ہیں۔
                            ",
                            ],
                            [
                                'text' => "میں ای الکھف فار سسٹرز  سے دو سال سے منسلک ہوں۔ الحمدللہ ثم الحمدللہ خاصہ ثانی میں جب پہلی بار میرا تعارف ای الکھف فار سسٹرز سے ہوا میں نے دیکھا یہ تو ایک نئی دنیا ہے جس سے میں متعارف نہیں تھی پہلا سال مدرسے جا کر پڑھا اور خاندان بھی الحمدللہ دیندار طبقہ ہے مگر جو عمل کرنے کا جذبہ یہاں ملا وہ کہیں اور نہیں دیکھا۔ اللہ تعالیٰ کی کرم نوازی ہے آج عالیہ اول کی طالبہ ہوں۔اور عالیہ اول نے تو جیسے ایک نئی روح پھونک دی، رب سے جڑنے کے اس سفر میں میری جتنی مدد اس ادارے نے کی وہ بیان کرنے سے قاصر ہوں،فقط اتنا کہوں گی:
                            یہ علم و ہنر کا گہوارہ
                            تاریخ کا وہ شاہ پارہ ہے
                            ہر پھول یہاں اک شعلہ ہے
                            ہر سرو یہاں مینارہ ہے
                            اللہ تبارک و تعالیٰ حضرت اقدس پیر ذوالفقار احمد نقشبندی کو اور ان کے خلیفئہ مجاز حضرت مولانا ابراھیم احمد نقشبندی کو اجر عظیم عطا فرمائیں۔اور ان کا سایہ تادیر قائم فرمائیں ۔آمین یا رب
                            ",
                            ],
                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                            اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                            اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                            بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                            ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                            آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                            پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                            ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                            میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                            ",
                            ],
                        ]],
                    [
                        'id' => 5,
                        'class_name' => 'تخصص فی الدعوۃ والارشاد',
                        'contact' => '+923363597816',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'یہ کورس بیش بہا فوائد و ثمرات پر مشتمل ہے جن میں سر فہرست امت مسلمہ اور اسلامی معاشرے کو ایسی تربیت یافتہ خواتین مہیا کرنا ہیں جو اخلاقِ نبوی و آدابِ اسلامیہ سے آراستہ و پیراستہ،اخلاص و للہیت کے جذبوں سے لیس ہوکر دعوتِ دین کا عظیم فریضہ سر انجام دیں، دعوتِ دین اور تبلیغ و ابلاغ کے اصول و آداب سے واقف ہوکر عصری تقاضوں سے بھرپور شناسائی حاصل کرکے دنیا بھر میں اسلام کا صحیح نقشہ اور تصویر پیش کریں، قلبی ذہنی اور روحانی تطہیر و تزکیہ کے ساتھ انوارِ اسلام سے دجالی فتنوں کے سامنے آہنی تلوار بنیں اور اسلام کے مضبوط دلائل سے اقوامِ عالم کو دین کی حقیقی روح سے باخبر کریں۔',
                        'description' => 'کیا آپ
                        - تدریس کے جدید اصولوں سے واقفیت حاصل کر کے ایک کامیاب معلمہ بننا چاہتی ہیں؟
                        -  علوم و فنون کی تدریس کے آسان اور سہل طریقے جاننا چاہتی ہیں؟
                        - ادارے کے نظم و نسق کو چلانے کی پروفیشنل صلاحیت حاصل کرنا چاہتی ہیں؟
                        - کمپیوٹر اور لیپ ٹاپ کے ذریعے جدید ٹیکنالوجی اور ذرائع سے طریقہ ہائے تدریس میں مہارت اور گرافکس سیکھنا چاہتی ہیں؟
                        - ففتھ جنریشن وار ایک بہت بڑا المیہ ہے جس سے بہت کم لوگ واقف ہیں تو کیا آپ موجودہ اور آئندہ آنے والی نسل کے لیے آگاہی مہم چلانا چاہتی ہیں؟
                        - اپنی اور اپنی جنریشن کی ذہنی،جسمانی اور روحانی صحت کے راز جاننا چاہتی ہیں؟
                        -  قلمی دعوت و تبلیغ کرنا چاہتی ہیں؟',
                        'fee' => '2500',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'تخصص فی الدعوۃ والارشاد کا وقت',
                        'image_url' => 'images/courselist/diploma/5.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'خصوصیات',
                                'books' => [
                                    'قران و حدیث کے دعوتی اصول و مناہج سے آگاہی و عملی تربیت',
                                    'دروس سیرت: دور حاضر میں سیرت طیبہ کی عملی تطبیق',
                                    'تاریخ اسلام اور اس کے عروج و زوال کے اسباب سے آگاہی',
                                    'پرنٹ، الیکٹرانک اور سوشل میڈیا پر دعوتی و ابلاغی سرگرمیوں کی عملی تربیت',
                                    'انگریزی اور عربی پر خصوصی توجہ',
                                    'نظریاتی جنگ (الغزوالفکری) کے میدان سے واقفیت',
                                    'مشہور مذاہب و فرق کا تقابل',
                                    'تصوف و سلوک کی اہمیت سے واقفیت',
                                    'ذہنی صحت آگاہی پروگرام',
                                    'علمائے دین سے احکام شرعیہ میں پوشیدہ دعوت کے گر جاننا',
                                    'ریسرچ میتھاڈولوجی دور حاضر کے اہم موضوعات پر مقالہ',
                                ],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 6,
                        'class_name' => 'طریق الجنۃ',
                        'contact' => '+923134841851',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'ایک سالہ کورس خاص کر عام عوام کیلئے رکھا گیا ہے جس میں قرآن، حدیث، فقہ کی بنیادی تعلیمات فراہم کی جاتی ہیں۔اور اس بات کا بھی خاص خیال رکھا گیا کہ اس کورس کی کلاسز Weekend میں رکھی جائیں۔',
                        'description' => '◀️اساتذہ کی مکمل نگرانی
                        ◀️اسباق کی ریکارڈنگ کی فراہمی

                        ساتھ ساتھ
                        ◀️اخلاقی و روحانی ورکشاپس
                        ◀️ذہنی سکون کے موافق مختلف ورکشاپس',
                        'fee' => '2000',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'طریق الجنۃ کا وقت',
                        'image_url' => 'images/courselist/diploma/6.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'نصاب',
                                'books' => [
                                    'تفسیر(درسی کتاب) عم پارہ مکمل',
                                    'خلاصتہ التجوید',
                                    'آسان بہشتی زیور',
                                    'عربی گرائمر  لیول 1',
                                    'سیرت مبارکہ',
                                    'زاد الطالبین',
                                    'جوامع الکلم',
                                ],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 7,
                        'class_name' => 'قرآنی عربک',
                        'contact' => '+971529070937',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'قرآن کریم اللہ کا کلام اور براہ راست آسمانی ہدایت کی آخری کڑی اور عظیم الشان کتاب ہے جس نے  تاریخ انسانی کا رخ  موڑ دیا ہے ۔ یہ واحد آسمانی  کتاب ہے جو قریب ڈیڑھ ہزار سال سے اب تک اپنی اصل زبان میں  محفوظ ہے ۔ اس پر ایمان لانامسلمان ہونے کی ایک ضروری شرط اوراس کا  انکار کفر کے مترادف ہے اس کی  تلاوت باعث برکت وثواب ہے،اور فہم رشد وہدایت اوراس کے مطابق عمل  فلاح  وکامرانی کی ضمانت ہے ۔کتاب اللہ  کی اسی اہمیت کے پیش نظر ضروری تھا کہ بنات امت اسے زیادہ سے زیادہ سمجھنے کی کوشش کریں۔ اگر چہ آج الحمد للہ اردو میں قرآن مجید کے بہت سے تراجم وتفاسیر ہیں،تاہم اس حقیقت سے انکار نہیں کیا جاسکتا کہ قرآن کو قرآن کی زبان میں سمجھنے کا جو مقام ومرتبہ ہےوہ محض ترجموں سے حاصل نہیں ہوسکتا۔عربی زبان اور قرآن مجید کی تعلیم وتفہیم کےلیے اہل علم نے تعلیم وتدریس اور تصنیف وتالیف کے ذریعے  کوششیں کی ہیں۔جن سے مستفید ہوکر قرآن مجید میں موجود احکام الٰہی کو سمجھا جاسکتا ہے۔ اسی سلسلے کی ایک کڑی ہمارا یہ قرآنی عربی کورس بھی ہے۔قرآن مجید کاترجمہ سکھلانے کا مؤثر ترین ذریعہ ہے۔جس کا بنیادی مقصد براہِ  راست قرآن فہمی ہے۔جسے عمدہ اسلوب سے  مرتب و قرآنی مثالوں سے مزین کیاگیا ہے۔ جو مستورات قرآن کریم کو قرآنی زبان میں سمجھنا چاہتی ہیں۔ان شاء اللہ  وہ اس کورس کے ذریعے مختصر عرصے میں اتنی استعداد بنا سکتی ہیں کہ قرآن مجید کو سمجھ کر پڑھ  سکیں۔',
                        'description' => 'تفصیلات کا بیان قرآنک عربک کے بارے میں',
                        'fee' => '2000',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'قرآنک عربک کا وقت',
                        'image_url' => 'images/courselist/diploma/7.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 8,
                        'class_name' => 'مکمل تفسیرکورس',
                        'contact' => '+18484686273',
                        'intro' => 'یہ بھی ایک اہم کورس ڈیزائن کیا گیا ہے جو خاص طور پر ایسی مستورات کیلئے رکھا گیا جو قرآن کریم سے براہ ِ راست استفادے کی خواہاں ہے اور زیادہ وقت بھی نہیں دے سکتیں۔
                        اس کورس میں قرآن کریم کی مکمل تفسیر، تجوید اور عربی گرامر کو نصاب کا حصہ بنایا گیا ہے۔
                        ',
                        'description' => 'ابراہیم اکیڈمی آن لائن کے زیرِ انتظام یک سالہ مکمل تفسیر قرآن کریم کورس میں ہر عمر کی خواتین اور مصروف گھریلو خواتین کی مصروفیات اور اوقات کی رعایت رکھتے ہوئے نظام ترتیب دیا گیا ہے۔

                        واضح رہے جو خواتین باقاعدہ کلاسز لیں گی وہ دورانِ سال مختلف امتحان بھی دیں گی ، مثلاً تفسیر، تجوید اور گرامر کے ہفتہ وار ٹیسٹ ، مڈٹرم و فائنل امتحان ۔
                       ان کی روزانہ لائیو کلاس یا ریکارڈنگ کی بنیاد پر حاضری ہوگی۔
                       صرف انھی طالبات کو سند دی جائے گی ',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'fee' => '1500',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => '
                        •	کلاس سورۃ الفاتحہ تا سورۃ التوبہ
                        صبح 10:00 تا 11:00
                        •	کلاس سورۃ یونس تا سورۃ العنکبوت
                        صبح 11:00 تا 12:00
                        •	کلاس سورۃ الروم تا سورۃ الناس
                        صبح 12:00 تا 01:00',
                        'image_url' => 'images/courselist/diploma/8.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                ],
            ],
            [
                'course_name' => 'سالانہ شارٹ کورس',
                'classes' => [
                    [
                        'id' => 9,
                        'class_name' => 'ریاض الصالحین کورس',
                        'contact' => '+923156614836',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'حالات و ضروریات کے تقاضوں کو مد نظر رکھتے ہوئے مختلف کورسز کا انعقاد کیا جاتا ہے ',
                        'description' => 'تفصیلات کا بیان ریاض الصالحین کورس کے بارے میں',
                        'fee' => '1000 Only Registration fees',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'قرآنک عربک کا وقت',
                        'image_url' => 'images/courselist/shortyearly/1.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 10,
                        'class_name' => 'حیات الصحابۃ کورس',
                        'contact' => '+923156614836',
                        'intro' => 'حالات و ضروریات کے تقاضوں کو مد نظر رکھتے ہوئے مختلف کورسز کا انعقاد کیا جاتا ہے ',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'description' => 'تفصیلات کا بیان حیات الصحابۃ کورس کے بارے میں',
                        'fee' => '1000 Only Registration fees',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'حیات الصحابۃ کورس کا وقت',
                        'image_url' => 'images/courselist/shortyearly/2.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    // [
                    //     'id' => 11,
                    //     'class_name' => 'ختم نبوت کورس',
                    //     'description' => 'تفصیلات کا بیان ختم نبوت کورس کے بارے میں',
                    //      'fee' => 'فری',
                    //     'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                    //     'time' => 'ختم نبوت کورس کا وقت',
                    //     'image_url' => 'images/courselist/shortyearly/3.jpeg'
                    // ]
                ],
            ],
            [
                'course_name' => 'ٹربیہ ڈیپاٹمنت',
                'classes' => [
                    [
                        'id' => 12,
                        'class_name' => 'تجوید کورس',
                        'contact' => '+923360056777',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'حالات و ضروریات کے تقاضوں کو مد نظر رکھتے ہوئے مختلف کورسز کا انعقاد کیا جاتا ہے ',
                        'description' => '(آن لائن بذریعۂ واٹس ایپ)
                        تجوید کے ساتھ قرآن پڑھنا سیکھیں ',
                        'fee' => '500',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'تجوید کورس کا وقت',
                        'image_url' => 'images/courselist/trbeyah/1.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'لیول',
                                'books' => [
                                    'لیول ۱ ۵۰۰ روپہ',
                                    'لیول ۲ ۵۰۰ روپہ',
                                    'لیول ۳ ۵۰۰ روپہ',
                                ],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 13,
                        'class_name' => 'سیرت کورس',
                        'contact' => '+923128723741',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'جامعہ کی طرف سے اصلاحِ نفس کے سلسے میں  ایک مکمل  تربیتی نظم ہے اس کے تحت  مختلف شعبہ جات واٹس ایپ گروپ کی شکل میں ترتیب دیے گئے  ہیں تاکہ وہ خواتین بھی ضروری  علمِ دین آسان انداز میں  حاصل کرسکیں  جن کے لئے زوم  کے آنلائن نظم کے مطابق کلاسز لینا مشکل ہوتا ہے ۔',
                        'description' => 'تفصیلات کا بیان سیرت کورس کے بارے میں',
                        'fee' => 'فری',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'سیرت کورس کا وقت',
                        'image_url' => 'images/courselist/trbeyah/2.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 14,
                        'class_name' => 'ختم نبوت کورس',
                        'contact' => '+923214048294',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'جامعہ کی طرف سے اصلاحِ نفس کے سلسے میں  ایک مکمل  تربیتی نظم ہے اس کے تحت  مختلف شعبہ جات واٹس ایپ گروپ کی شکل میں ترتیب دیے گئے  ہیں تاکہ وہ خواتین بھی ضروری  علمِ دین آسان انداز میں  حاصل کرسکیں  جن کے لئے زوم  کے آنلائن نظم کے مطابق کلاسز لینا مشکل ہوتا ہے ۔',
                        'description' => 'تفصیلات کا بیان ختم نبوت کورس کے بارے میں',
                        'fee' => 'فری',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'time' => 'ختم نبوت کورس کا وقت',
                        'image_url' => 'images/courselist/trbeyah/3.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 15,
                        'class_name' => 'حفظ حدیث',
                        'contact' => '+923212531707',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'جامعہ کی طرف سے اصلاحِ نفس کے سلسے میں  ایک مکمل  تربیتی نظم ہے اس کے تحت  مختلف شعبہ جات واٹس ایپ گروپ کی شکل میں ترتیب دیے گئے  ہیں تاکہ وہ خواتین بھی ضروری  علمِ دین آسان انداز میں  حاصل کرسکیں  جن کے لئے زوم  کے آنلائن نظم کے مطابق کلاسز لینا مشکل ہوتا ہے ۔',
                        'description' => 'تفصیلات کا بیان حفظ حدیث کورس کے بارے میں',
                        'fee' => 'فری',
                        'time' => 'حفظ حدیث کا وقت',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'image_url' => 'images/courselist/trbeyah/4.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 16,
                        'class_name' => 'مسنون دعائیں',
                        'contact' => '+447448988686',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'جامعہ کی طرف سے اصلاحِ نفس کے سلسے میں  ایک مکمل  تربیتی نظم ہے اس کے تحت  مختلف شعبہ جات واٹس ایپ گروپ کی شکل میں ترتیب دیے گئے  ہیں تاکہ وہ خواتین بھی ضروری  علمِ دین آسان انداز میں  حاصل کرسکیں  جن کے لئے زوم  کے آنلائن نظم کے مطابق کلاسز لینا مشکل ہوتا ہے ۔',
                        'description' => 'تفصیلات کا بیان مسنون دعائیں کورس کے بارے میں',
                        'fee' => 'فری',
                        'time' => 'مسنون دعائیں کا وقت',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'image_url' => 'images/courselist/trbeyah/5.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                    [
                        'id' => 17,
                        'class_name' => 'حفظ قرآن',
                        'contact' => '+923212531707',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'جامعہ کی طرف سے اصلاحِ نفس کے سلسے میں  ایک مکمل  تربیتی نظم ہے اس کے تحت  مختلف شعبہ جات واٹس ایپ گروپ کی شکل میں ترتیب دیے گئے  ہیں تاکہ وہ خواتین بھی ضروری  علمِ دین آسان انداز میں  حاصل کرسکیں  جن کے لئے زوم  کے آنلائن نظم کے مطابق کلاسز لینا مشکل ہوتا ہے ۔',
                        'description' => 'تفصیلات کا بیان حفظ قرآن کورس کے بارے میں',
                        'fee' => '500',
                        'time' => 'حفظ قرآن کا وقت',
                        'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                        'image_url' => 'images/courselist/trbeyah/6.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "میں الحمدللہ تین سال سے الکھف اکیڈمی کے ساتھ ہوں اور یہ دینی تعلیم سیکھنے کے لیے بہت اچھا ادارہ ہے یہاں کی تمام معلمات بہت اچھی ہیں بہت اچھے سے طالبات کو سمجھاتی ہیں ہر بات اور جو بھی سبق آتا ہے اس کی ریکارڈنگ بھی ساتھ آتی ہے تاکہ اگر کچھ سمجھ نہ آئے تو ریکارڈنگ سن کر سمجھ لیں ۔اور باجی جان سے بھی جتنی دفعہ پوچھو الحمدللہ باجی اتنی دفعہ ہی بتاتی ہیں ۔مجھے اس ادارے سے بہت زیادہ لگاؤ ہے اس لیے اس ادارے میں جو بھی شارٹ کورسز شروع ہوتے ہیں میں لازمی کرتی ہوں۔",
                            ],
                            [
                                'text' => "میں اس گروپ میں چھ ماہ سے ہوں اور الحمد و للہ بہت کچھ سیکھا ہے اور بہت گناہوں سے بچنے کی توفیق ملی ہے۔",
                            ],
                            [
                                'text' => "الحمدللہ ادارے سے جڑے ہوئے یہ چوتھا سال ہے ۔مکمل تفسیر سے شروع ہونے والا یہ خوبصورت سفر جو اب درس نظامی عالیہ اول میں پہنچ گیا ہے ۔ ہر موقع پہ ہر لحاظ سے ہمیشہ ادارے کو منفرد پایا۔ پھر چاہے وہ معلمین و معلمات کا حسن سلوک و بہترین انداز تدریس ہو یا انتظامیہ کی حکمت عملی ،الغرض ادارے میں محض پڑھائی ہی نہیں بلکہ دیگر معاشرتی سلوک ، اخلاقیات اور روحانیت پہ بیک وقت محنت نہ صرف آن لائن پڑھنے والوں کے لیے ایک بیش قیمت خزانہ ہے بلکہ ایک مثال ہے آن لائن طرز تعلیم کے لیے ۔",
                            ],
                            [
                                'text' => "میں ابراہیم اکیڈمی میں پانچ سال سے مختلف کورسز پڑھ رہی ہوں۔ آج کل میں عالیہ اول میں ہوں اس سے پہلے طریق الجنہ ،تجوید، اصلاح نفس کے کورسز کیے۔ ابراہیم اکیڈمی ایک بہت بہترین درسگاہ ہے جہاں محبت سے پڑھانے والی معلمات ہیں پرنسپل صاحبہ کا تربیت کا انداز بہت پیارا ہے تمام معلمات بہت پیار اور محبت سے پڑھاتی ہیں اور دین کے ساتھ جوڑے رکھتی ہیں، ساتھ ساتھ تربیت بھی کرتی ہیں ۔اللہ تعالی ٰاس ادارے کو دن دگنی رات چگنی ترقی دے ۔سب سے بڑی بات یہ ہے کہ درود شریف کے ساتھ جوڑ دیا ہے ہر  15 دن کے بعد ایک نیا درود شریف پڑھنے کو ملتا ہے جس کو ہم شوق سے پڑھتے ہیں اللہ تعالی تمام اعمال کو قبول فرمائے اور اپنے والدین اپنے شوہر اور اپنے اساتذہ کے لیے صدقہ جاریہ بنائیں ۔آمین ثم آمین۔",
                            ],
                            [
                                'text' => "مفہومِ حدیث ہے تم میں بہترین وہ ہے جو قرآن سیکھیں اور سکھائیں۔ الکھف ٹرسٹ اس پر پوری طرح کامیاب میں پچھلے چند سالوں سے جڑی ہوئی ہوں اللہ تعالیٰ کے فضل سے روز کوئی ایک نہ ایک بات مجھے اپنے اللہ تعالیٰ سے اپناتعلق مضبوط کرنے میں مدد کرتی ہے۔ اللہ تعالیٰ اس ادارے کا فیض تاقیامت جاری رکھیں اور قیامت تک آ نے والا آ خری ایمان والا بھی اس سے فیضیاب ہو۔ آ مین ثم آمین یا رب العالمین۔",
                            ],
                            [
                                'text' => "ای الکھف فار سسٹرز آن لائن ادارے سے میں چھ سال سے منسلک ہوں ۔الحمدللہ میں نے اس ادارے سےچار سالہ تعلیم القران کورس ،تخصص فی الدعوہ والارشاد اور تخصص فی التفسیر کیا ہے۔ ",
                            ],
                            [
                                'text' => "اس ادارے کی سب سے بڑی خصوصیت جو میں نے دوسرے اداروں کی نسبت دیکھی وہ یہ کہ جو طریقہ تدریس نبی پاک صلی اللہ علیہ وسلم نے سکھایا وہی طریقہ تدریس ہمیں عملی طور پر اس ادارے میں نظر آتا ہے ۔یہاں اساتذہ کرام اور  معلمات بہت محبت اور شفقت کے ساتھ پڑھاتے ہیں ۔اور نہ صرف تعلیم بلکہ تربیت کا بھی خصوصی انتظام کیا جاتا ہے ۔ہمیں زندگی کے ہر پہلو کے بارے میں رہنمائی فراہم کی جاتی ہے۔اللہ رب العزت ادارے کو اور حضرت محمد ابراہیم نقشبندی اور ان کی اہلیہ مد ظلھما تمام منتظمین و معاونین کومزید قبولیت عطا فرمائیں۔ آمین",
                            ],
                            [
                                'text' => "الحمدللہ! 5/6 سال قبل الکہف کے چمن کے ایک ننھی سی کلی کے طور پہ کھلی، جہاں تعلیم و تربیت کا عمدہ انتظام، معلمات پرخلوص  مع محنت محبت، نکھار کر طالبات کو کندن بنایا جاتا، واللہ کوئی ایسا ادارہ نہیں ملا آج تک۔اللہ پاک نظر بد سے بچائے. آمین",
                            ],

                            [
                                'text' => "کووڈ کا زمانہ تھا ہر طرف خوف وہراس کا عالم تھا
                                اورسب دعاؤں میں مشغول تھے ۔ایسے میں رمضان المبارک کے بابرکت مہینے میں  اللّٰہ رب العزت نے ہماری دعا بھی سن لی اور ہمیں  الکہف سے جوڑ دیا۔
                                اس پر فتن دور میں الکہف ملنا ایسا ہی تھا  جیسے سورہ کہف کا کہف ۔الحمدللہ ثم الحمدللہ !
                                بس پھر دورہ قرآن کے بعد تجوید کے شارٹ کورسسز کیے ۔اسکے بعد طریق الجنہ میں قدم رکھا ۔طریق الجنہ واقعی جنت میں جانے کے لیئے بہترین رستہ ثابت ہوا یہاں سے ہم قبول ہوکر درس نظامی کے عظیم کورس کی طالبہ بنے ۔اب ہم خاصہ ثانی کی طالبہ ہیں ۔الحمدللہ
                                ",
                            ],
                            [
                                'text' => "ادارے سے 4 سال سے منسلک ہوں الحمدللہ۔
                                آج تک ایسا ادارہ آنلائن مجھے نہیں ملا معلمات کا خلوص ہر ہر چیز میں راہنمائی بیان سے باہر ہے۔۔فی الوقت قرآنی عربی کورس کی طالبہ ہوں انتہای شفیق معلمات ہر وقت ہر مشکل کا حل نکالنے میں راہنمائی ملتی ہے ہر طرح سے ہمارے  ساتھ کوپریٹ کیا جاتا ہے الحمدللہ ثم الحمدللہ !
                                پڑھائی کے ساتھ ساتھ تربیت پر بہت محنت کی جاتی ہے الحمدللہ ثم الحمدللہ !اسی کے ساتھ بہت ساری ورکشاپس سیرت النبی صلی اللہ علیہ وسلم کی نشستیں بھی ہمارے لیئے منعقد کی جاتی ہیں۔اللہ کریم ہماری معلمات  کو بہت جزائے خیر دیں ۔اللہ پاک دن دگنی رات چگنی ترقیاں عطا فرمائے۔ اس ادارے کا فیض عام کریں۔ آمین ثم آمین۔
                                ",
                            ],
                            [
                                'text' => "الحمدللہ پچھلے 7 سال سے الکھف کے ساتھ  منسلک ہوں اللہ پاک کے کرم سے یہاں سے تعلیم القرآن ترجمہ تفسیر اور بہت سارے کورسز کئے الحمدللہ ایک  انسان سے اچھا اور بہترین انسان کیسے بننا ہے یہاں سے سیکھنے کو ملا۔روحانی اصلاح کے لیے الکھف واقعی اہل کھف والا الکھف ہے",
                            ],
                            [
                                'text' => "باجی مجھے اس ادارے سے جڑے 2 ، 3 سال ہو گئے ہیں۔ماشاءاللہ بہت ہی عمدہ ادارہ ہے۔ میں نے اس دارے سے بہت کچھ سیکھنے کا موقع ملا ہے۔ اور اس کو عملدرآمد بھی کیا ہے
                                میں اس وقت سیرت النبی صلی اللہ علیہ وسلم اور مسنون دعائیں میں زیر تربیت ہوں ۔
                                ",
                            ],
                        ],
                    ],
                ],
            ],
        ];

        $classDetails = null;
    foreach ($courseData as $course) {
        foreach ($course['classes'] as $class) {
            if ($class['class_name'] == $classname) {
                $classDetails = $class;
                break 2; // Break both loops on finding the class
            }
        }
    }

        // Check if class details found for the provided ID
        if (!$classDetails) {
            // Handle 404 error: return appropriate view with error message
            return view('error', ['error' => 'Class not found.']);
        }

        // Extracting class names
        $classNames = collect($courseData)->flatMap(function ($course) {
            return collect($course['classes'])->pluck('class_name');
        })->take(10)->all();
    

        return view('courselist', [
            'classes' => collect($courseData)->flatMap(function ($course) {
                return $course['classes'];
            })->all(), // Pass all classes as $classes
            'classNames' => $classNames,
            'classDetails' => $classDetails,
        ]);
    }

    public function showEng($classname = null)
    {
        // Your course data array
        $courseData = [

            [
                'course_name' => 'ڈیپلومہ کورسس',
                'classes' => [
                    [
                        'id' => 1,
                        'class_name' => 'Six-Year Dars-e-Nizami Program',
                        'contact' => '+923171186816',
                        'description' => 'Dars-e-Nizami is a curriculum compiled by the renowned 12th-century scholar Mullah Nizamuddin Sahalvi, consisting of books covering twenty different sciences and arts. These subjects include grammar, rhetoric, logic, philosophy, astronomy, theology, debate, jurisprudence, the principles of jurisprudence, exegesis, Hadith, mathematics, chemistry, and medicine. Initially, this curriculum was taught in its original form in madrasahs, but over time, scholars have made adjustments based on the needs and demands of the era. These revisions continue to this day to keep the curriculum relevant to contemporary challenges and requirements. The six-year structured educational program of Dars-e-Nizami includes the following prescribed books:',
                        'tagline' => 'A unique leadership program exclusively for female students and women. ',
                        'intro' => 'Dars-e-Nizami for women is a rich treasure of Islamic sciences. It thoroughly teaches lessons in Tafsir, Hadith, Fiqh, and Arabic literature. A student who completes this program becomes well-versed in religious sciences and deeply grounded in the faith. A graduate of this program is equivalent to a Master’s degree holder. Additionally, experienced teachers are dedicated to the religious training of students and to developing proficiency in household management skills, which are essential attributes for a Muslim woman. The curriculum follows the syllabus of Wifaq-ul-Madaris Al-Arabia Pakistan, and exams are also conducted by Wifaq. Under the guidance of Hazrat Ji Hafiz Ibrahim Naqshbandi Mujaddidi, a disciple authorized by Hazrat Maulana Pir Hafiz Zulfiqar Ahmed Naqshbandi, E-Al-Kahf for Sisters is actively involved in the field of online education and training, offering the six-year Dars-e-Nizami course for women and girls. This course is divided into three levels, each lasting two years',
                        'fee' => '2500',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday',
                        'time' => '10 AM TO 1 PM',
                        'image_url' => 'images/courselist/diploma/1.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'Khasa Awal',
                                'books' => ['Tafsir Amma Part Complete', 'Aasan Tajweed', 'Jawami al-Kalim + Zad al-Talibeen', 'Ilm al-Sarf', 'Ilm al-Nahw', 'Tariqat al-Asriyyah + Awamil al-Nahw', 'Taleem al-Islam + Tarikh al-Islam', 'Arabi Ka Moallim'],
                            ],
                            [
                                'subject_name' => 'Khasa Sani',
                                'books' => ['Tafsir-ul-Quran (Surah Yunus to Surah Ankabut)', 'Ilm al-Seegha', 'Al-Mukhtasar al-Quduri', 'Usul al-Fiqh', 'Usul al-Shashi', 'Hidayat al-Nahw', 'Sharh Maani al-Awamil', 'Tayseer al-Mantiq'],
                            ],
                            [
                                'subject_name' => 'Aaliyah Awal',
                                'books' => ['Tafsir-ul-Quran Surah (Surah Rum to Surah Tahreem)', 'Riyadh al-Saliheen', 'Al-Mukhtasar al-Quduri', 'Ilm al-Mirath', 'Duroos al-Balagha', 'Noor al-Anwar', 'Mukhtarat', 'Aqeedah Tahawiyyah'],
                            ],
                            [
                                'subject_name' => 'Aaliyah Sani',
                                'books' => ['Tafsir-ul-Quran (Surah Fatihah to Surah Tawbah)', 'Mishkat Sharif Volume One', 'Mishkat Volume Two', 'Hidayah Volume One', 'Khair al-Usul', 'Ulum al-Quran', 'Sharh Aqaid', 'Tarbiyat Awlad'],
                            ],
                            [
                                'subject_name' => 'Alamiyah Awal',
                                'books' => ['Jalalain Sharif Volume One', 'Sunan Abu Dawood Volume One', 'Jami at-Tirmidhi Volume Two', 'Tayseer al-Mustalah al-Hadith', 'Tahawi Sharif', 'Hidayah Volume Two', 'Ainah Qadianiyat'],
                            ],
                            [
                                'subject_name' => 'Alamiyah Sani',
                                'books' => ['Sahih Bukhari Volume One', 'Sahih Bukhari Volume Two', 'Sahih Muslim Volume One', 'Sahih Muslim Volume Two', 'Jami at-Tirmidhi Volume One', 'Sunan Abu Dawood Volume Two', 'Shama il Tirmidhi'],
                            ],
                        ],
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ]
                    , [
                        'id' => 2,
                        'class_name' => 'Darasat-e-Deeniya',
                        'contact' => '+923331254560',
                        'tagline' => 'Here Comes a Brief Introduction',
                        'intro' => 'Another endeavor of the institution is for those women who cannot dedicate much time to studies but still aspire for knowledge... For them, a two-year part-time Alimah course has been arranged since 2022 under the auspices of Wafaqul Madaris Al-Arabiya, incorporating female students from Pakistan and abroad.
                            Brief commentary, Hadith, and Arabic sciences are imparted to the students. The purpose of this short duration course is to instill confidence in these women and provide them with essential religious knowledge, which becomes challenging in longer courses, thus, a two-year comprehensive course is no less than a precious gem for such women.',
                        'description' => '◀️ Complete supervision of the teachers
                        ◀️ Provision of course recordings
                         ◀️ Ethical and spiritual workshops
                        ◀️ Various workshops for mental peace
                            ◀️ Intellectual warfare (fifth generation war) and awareness of Islamic history',
                        'fee' => '2500',
                        'time' => '3 pm to 6 pm',
                        'days' => 'Peer, Mangal, Budh, Jumeraat, aur Hafta',
                        'image_url' => 'images/courselist/diploma/2.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'First Year',
                                'books' => [
                                    'Tafseer (Surah Yunus 11 تا Surah Ankaboot 21)',
                                    'Maarif al-Hadith (Jild 2, 3, 4)',
                                    'Taleem al-Islam (Mufti Kifayatullah Nur al-Allah Marqadah)',
                                    'Bahishti Zewar Qadeem (Hissa 2, 3, 4) (Maulana Ashraf Ali Thanwi)',
                                    'Qasas al-Nabiyeen (1, 2)',
                                    'Seerat al-Khatam al-Anbiya (Sallallahu Alayhi Wasallam)',
                                    'Ilm al-Sarf (Awwaleen)',
                                    'Ilm al-Nahw',
                                    'At-Tariqah al-Asriyah (Awwal)',
                                ],
                            ],
                            [
                                'subject_name' => 'Second Year',
                                'books' => [
                                    'Tarjuma wa Tafseer (Ma Baqiya Quran Kareem)',
                                    'Maarif al-Hadith (Jild 1, 5, 6, 7)',
                                    'Bahishti Zewar Qadeem (Hissa 5, 6, 7) (Maulana Ashraf Ali Thanwi)',
                                    'Qasas al-Nabiyeen (3, 4)',
                                    'Ilm al-Sarf (Aakhireen)',
                                    'Awamil al-Nahw',
                                    'At-Tariqah al-Asriyah (Doam)',
                                    'Hayat al-Muslimin',
                                ],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 3,
                        'class_name' => 'Takhassus fi at-Tafsir',
                        'contact' => '+923363597816',
                        'tagline' => 'Brief introduction will be provided here',
                        'intro' => 'This is a one-year Quranic education specialization that offers in-depth understanding and expertise in Quranic sciences and arts under the supervision of esteemed scholars with extensive experience. Rooted in a fourteen-century-old scholarly tradition, it aims to explore the rise and fall of nations, all connected to the Quranic text. This course essentially endeavors to prepare a group capable of conveying the correct contents and meanings of the Quran to the public in a comprehensible, simple, and eloquent manner, and to enlighten them with divine messages and revelations, transmitting Quranic concepts to the next generation in the light of the Sunnah, the traditions of the companions, the consensus of the Ummah, and the understanding of the predecessors.',
                        'description' => '
                        For distinguished female scholars only,
                        📝 Research under the supervision of experts on Quranic subjects
                        📝 Study of classical and contemporary exegeses under the guidance of scholars
                        📝 Scholarly awareness and utilization from classical and contemporary exegeses
                        📝 Practical application of Quranic study
                        📝 Introduction to relevant books
                        📝 Awareness of contemporary exegetes
                        📝 Special attention to basic English and computer courses
                        📝 Training and workshops
                        ',
                        'fee' => '2500',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'تخصص فی التفسیر کا وقت',
                        'image_url' => 'images/courselist/diploma/3.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'Onwaanat',
                                'books' => ['Ilm al-Quran ke Ahem Mabahis', 'Usul al-Tafsir wa Qawaid al-Tafsir', 'Ahkam al-Quran', 'Balaghat al-Quran ki Amli Mushq', 'Ijaz al-Quran aur Mushtaqqeen', 'Qasas al-Quran wa Qurani Jughrafiya', 'Rasm-e-Usmani ka Tareef wa Ahmiyat', 'Qiraat Mutawatirah ka Tareef wa Ahmiyat', 'Dars-e-Quran ki Amli Mushq', 'Qadeem wa Jadeed Mufassireen ka Usloob wa Manhaj', 'Tajweed al-Quran ki Amli Mushq', 'Irab al-Quran'],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 4,
                        'class_name' => 'Takhassus fi Ifta',
                        'contact' => '+923363597816',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'Specialization in Ifta is a one-year course where qualified scholars are trained under the supervision of esteemed Muftis. They are taught to practice issues in a competent, superior, and unique manner in the light of sound principles and rules of jurisprudence. Moreover, they are acquainted with modern demands, new issues, and the language, style, and customs of society. One of the objectives is to provide society with skilled female scholars and Mufti women who, from their beliefs and theories, worship and ethics, to society, transactions, and trade, guide them with correct religious and jurisprudential guidance and facilitate them, particularly in matters of private concerns, to solve problems as efficiently as possible, having the ability to resolve issues properly instead of men.',
                        'description' => '• Special emphasis on writing etiquette, principles of issuing decrees, and practicing issuing decrees
                        • Special focus on 50 graduation theses including 100 decrees and inheritance issues with practical exercises
                        • Correction and refinement of decrees in a unique and special style
                        • Introduction to sources and references
                        • Method of issuing decrees of eminent jurists and introduction to their decrees and jurisprudential research
                        • Teaching method and exercise of jurisprudence books
                        • Systematic teaching of jurisprudential principles, jurisprudence of sales, and Shariah standards
                        • Establishment in the science of jurisprudence
                        • Introduction of honorable jurists and differences in their issues
                        • Astronomy, calculation of prayer times, direction of Qibla, teaching and practical exercises of moon sighting
                        • Introduction to modern economy and trade, Islamic banking, halal certification, and Takaful
                        • Short courses on various modern topics throughout the year
                        • Computer courses (MS Office, Excel, PowerPoint, Photoshop, and CorelDraw)
                        • Utilization method of digital libraries (Library Shumaila, Library Jibrail, Khadim al-Haramain, Maknoon, etc.)',
                        'fee' => '2500',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'تخصص فی الافتاء کا وقت',
                        'image_url' => 'images/courselist/diploma/4.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'Nisab',
                                'books' => [
                                    'Sharh Aqood Rasam al-Mufti',
                                    'Muqadma Shamiyah',
                                    'Usul al-Ifta wa Adabuh',
                                    'Adab-e-Fatawa Nususi',
                                    'Tamreen Ifta ki Hidayat',
                                    'Qawaid Fiqhiyah',
                                    'al-Siraji fi al-Mirath',
                                    'al-Ashbah wal-Nazair',
                                    'al-Hilah al-Najizah lil-Hilah al-Ajizah',
                                    'Fiqh al-Buyu',
                                    'Tarikh Fiqh wa Madhahib Fiqhiyah',
                                    'Imdad al-Fatawa',
                                    'Tashreef Musadir wa Kutub Fiqh',
                                    'Jadeed Fiqhi Masail wa Nazil ka Hal wa Manhaj',
                                    'Mutalia Kitaab Fiqh (Shami, Alamgiri, Fatawa Usmani)',
                                    'Irshad al-Talib lima fi al-Hidaya min al-Matalib',
                                    'Jawahir al-Fiqh Muntakhabat Digar Kutub Mufti Muhammad Shafi Sahib',
                                ],
                            ],
                        ],
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ]],
                    [
                        'id' => 5,
                        'class_name' => 'Takhassus fi al-Dawah wal Irshad',
                        'contact' => '+923363597816',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'This course offers numerous invaluable benefits, primarily aiming to provide the Muslim community and Islamic society with trained women who are adorned with the ethics of the Prophet and Islamic manners. They are equipped with sincerity and devotion to perform the great duty of inviting people to Islam. By being familiar with the principles and etiquettes of Islamic propagation and communication, they will gain comprehensive knowledge of contemporary demands and present the true picture of Islam worldwide. With mental, intellectual, and spiritual purification and illumination from Islam, they will become an iron sword against the deceptive forces and inform the nations of the world about the true essence of religion through the strong arguments of Islam.',
                        'description' => 'Do you want to:
- Become a successful teacher by learning modern teaching principles?
- Learn easy and simple methods for teaching various sciences and arts?
- Acquire professional skills to manage an institution?
- Master teaching methods and graphics using modern technology through computers and laptops?
- Raise awareness about the Fifth Generation War, a significant crisis known to few, for the current and future generations?
- Know the secrets of mental, physical, and spiritual health for yourself and your generation?
- Engage in written Islamic propagation?',
                        'fee' => '2500',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'Specialization in Dawah and Guidance timings',

                        'image_url' => 'images/courselist/diploma/5.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'Features',
                                'books' => [
                                    'Awareness and practical training on the principles and methodologies of Quran and Hadith propagation',
                                    'Lessons on Seerah: Practical application of the Seerah in the modern era',
                                    'Understanding the history of Islam and the causes of its rise and fall',
                                    'Practical training on propagation and communication activities in print, electronic, and social media',
                                    'Special focus on English and Arabic',
                                    'Familiarity with the field of ideological warfare (Al-Ghazw al-Fikri)',
                                    'Comparison of major religions and sects',
                                    'Understanding the importance of Sufism and spiritual practices',
                                    'Mental health awareness program',
                                    'Learning the hidden propagative aspects of Shariah rulings from religious scholars',
                                    'Research methodology and writing papers on important contemporary topics',
                                ],

                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 6,
                        'class_name' => 'Tareeq ul Jannah',
                        'contact' => '+923134841851',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'A one-year course specifically designed for the general public, providing basic teachings of the Quran, Hadith, and Fiqh. Special care has been taken to schedule the classes on weekends.',
                        'description' => '◀️Complete supervision by teachers
◀️Provision of recorded lessons

Additionally
◀️Moral and spiritual workshops
◀️Various workshops for mental peace',
                        'fee' => '2000',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'Tariq al-Jannah timings',
                        'image_url' => 'images/courselist/diploma/6.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'Curriculum',
                                'books' => [
                                    'Tafsir (textbook) Juz Amma complete',
                                    'Khilasat al-Tajweed',
                                    'Easy Bahishti Zewar',
                                    'Arabic Grammar Level 1',
                                    'Seerat Mubarakah',
                                    'Zaad al-Talibeen',
                                    'Jawami al-Kalim',
                                ],
                            ],

                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 7,
                        'class_name' => 'Qurani Arabic',
                        'contact' => '+971529070937',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'The Holy Quran is the final and magnificent book of divine guidance directly from Allah, which has altered the course of human history. It is the only heavenly book preserved in its original language for over fifteen hundred years. Belief in it is a necessary condition for being a Muslim, and its denial is synonymous with disbelief. Reciting it brings blessings and rewards, and understanding it leads to guidance, righteousness, and prosperity through righteous actions. Given the importance of the Book of Allah, it was imperative for the Muslim community to make efforts to understand it to the best of their abilities. Although there are numerous translations and interpretations of the Quran available in Urdu today, it cannot be denied that the status and rank of understanding the Quran in its own language cannot be achieved merely through translations. Scholars have made efforts in teaching, learning, and writing to facilitate the teaching and understanding of the Arabic language and the Quran. By benefiting from these efforts, one can understand the divine commandments present in the Holy Quran.',
                        'description' => 'Details about the Arabic Quran course',
                        'fee' => '2000',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'Arabic Quran timings',

                        'image_url' => 'images/courselist/diploma/7.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 8,
                        'class_name' => 'Mukammal Tafseer Course',
                        'contact' => '+18484686273',
                        'intro' => 'This is also an important course designed especially for those who desire to benefit directly from the Holy Quran but cannot devote much time. This course includes complete interpretation of the Holy Quran, Tajweed, and Arabic grammar as part of the curriculum.',
                        'description' => 'Under the management of Ibrahim Academy Online, a one-year complete Tafseer Quran course has been organized, taking into account the busy schedules of women of all ages and busy housewives. It is important to note that women who attend regular classes will also take various exams throughout the year, such as weekly tests for Tafseer, Tajweed, and grammar, midterm, and final exams. Their daily attendance will be based on live classes or recordings. Only those students who attend regularly will be awarded a certificate.',
                        'tagline' => 'A brief introduction will be provided here',
                        'fee' => '1500',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => '
• Class from Surah Al-Fatiha to Surah At-Tawbah
   Morning 10:00 AM to 11:00 AM
• Class from Surah Yunus to Surah Al-Ankabut
   Morning 11:00 AM to 12:00 PM
• Class from Surah Ar-Rum to Surah An-Nas
   Morning 12:00 PM to 01:00 PM',
                        'image_url' => 'images/courselist/diploma/8.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                ],
            ],
            [
                'course_name' => 'Salana Short Course',
                'classes' => [
                    [
                        'id' => 9,
                        'class_name' => 'Riyaz us Saliheen Course',
                        'contact' => '+923156614836',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'Various courses are organized while keeping in view the demands and necessities of the circumstances.',
                        'description' => 'Details about the Riyad al-Saliheen course',
                        'fee' => '1000 Only Registration fees',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'Arabic Quran timings',

                        'image_url' => 'images/courselist/shortyearly/1.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 10,
                        'class_name' => 'Hayat us Sahaba Course',
                        'contact' => '+923156614836',
                        'contact' => '+923363597816',
                        'intro' => 'Various courses are organized while taking into account the demands and necessities of the circumstances.',
                        'tagline' => 'A brief introduction will be provided here',
                        'description' => 'Details about the Hayat al-Sahabah course',
                        'fee' => '1000 Only Registration fees',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'Hayat al-Sahabah course timings',

                        'image_url' => 'images/courselist/shortyearly/2.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    // [
                    //     'id' => 11,
                    //     'class_name' => 'ختم نبوت کورس',
                    //     'description' => 'تفصیلات کا بیان ختم نبوت کورس کے بارے میں',
                    //      'fee' => 'فری',
                    //     'days' => 'پیر، منگل، بدھ، جمعرات اور ہفتہ',
                    //     'time' => 'ختم نبوت کورس کا وقت',
                    //     'image_url' => 'images/courselist/shortyearly/3.jpeg'
                    // ]
                ],
            ],
            [
                'course_name' => 'ٹربیہ ڈیپاٹمنت',
                'classes' => [
                    [
                        'id' => 12,
                        'class_name' => 'Tajweed Course',
                        'contact' => '+923357772010',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'Taking into account the requirements and necessities of circumstances, various courses are organized.',
                        'description' => '(Online via WhatsApp)
Learn Quran recitation with Tajweed.',
                        'fee' => '500',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'Tajweed Course Timing',
                        'image_url' => 'images/courselist/trbeyah/1.jpeg',
                        'subjects' => [
                            [
                                'subject_name' => 'Level',
                                'books' => [
                                    'Level 1 - 500 Rupees',
                                    'Level 2 - 500 Rupees',
                                    'Level 3 - 500 Rupees',
                                ],
                            ],
                        ]
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 13,
                        'class_name' => 'Seerat Course',
                        'contact' => '+923128723741',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'The university has a comprehensive system for self-improvement, under which various departments have been organized in the form of WhatsApp groups. This is to facilitate women in acquiring essential religious knowledge in an easy manner, for whom attending classes according to the online Zoom system becomes difficult.',
                        'description' => 'Details about the Seerat course',
                        'fee' => '0',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'Seerat course timings',

                        'image_url' => 'images/courselist/trbeyah/2.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 14,
                        'class_name' => 'Khatm-e-Nabuwwat Course',
                        'contact' => '+923214048294',
                        'tagline' => 'A brief introduction will be provided here',
                        'intro' => 'The university has a complete system of self-improvement, under which various departments have been organized in the form of WhatsApp groups. This is so that women can also easily acquire essential religious knowledge, for whom taking classes according to the online Zoom system becomes difficult.',
                        'description' => 'Details about the Khatm-e-Nabuwwat course',
                        'fee' => '0',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',
                        'time' => 'Khatm-e-Nabuwwat course timings',

                        'image_url' => 'images/courselist/trbeyah/3.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
        This cradle of knowledge and skill,
        This masterpiece of history,
        Every flower here is a flame,
        Every cypress here is a minaret.
    May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
    In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 15,
                        'class_name' => 'Hifz-e-Hadees',
                        'contact' => '+923212531707',
                        'tagline' => 'A brief introduction will be provided here',
                        'intro' => 'The university has a comprehensive system of self-improvement, under which various departments have been organized in the form of WhatsApp groups. This is so that women can also easily acquire essential religious knowledge, for whom taking classes according to the online Zoom system becomes difficult.',
                        'description' => 'Details about the Hadith Memorization course',
                        'fee' => '0',
                        'time' => 'Hadith Memorization course timings',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',

                        'image_url' => 'images/courselist/trbeyah/4.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
                                    This cradle of knowledge and skill,
                                    This masterpiece of history,
                                    Every flower here is a flame,
                                    Every cypress here is a minaret.
                                May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
                                In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 16,
                        'class_name' => 'Masnoon Duain',
                        'contact' => '+447448988686',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'The university has devised a comprehensive educational system for self-improvement, under which various departments have been arranged in the form of WhatsApp groups. This is to enable women to acquire essential religious knowledge in an easy manner, for whom taking classes according to the online Zoom system becomes difficult.',
                        'description' => 'Details about the Sunnah Duas course',
                        'fee' => '0',
                        'time' => 'Sunnah Duas course timings',
                        'tagline' => 'A brief introduction will be provided here',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',

                        'image_url' => 'images/courselist/trbeyah/5.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
                                    This cradle of knowledge and skill,
                                    This masterpiece of history,
                                    Every flower here is a flame,
                                    Every cypress here is a minaret.
                                May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
                                In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                    [
                        'id' => 17,
                        'class_name' => 'Hifz-e-Quran',
                        'contact' => '+923212531707',
                        'tagline' => 'یہاں مختصر تعارف آئے گا ',
                        'intro' => 'The university has designed a complete educational system for self-improvement, under which various departments have been organized in the form of WhatsApp groups. This is done so that women can also easily acquire essential religious knowledge, for whom taking classes according to the online Zoom system becomes difficult.',
                        'description' => 'Details about the Quran Memorization course',
                        'fee' => '500',
                        'time' => 'Quran Memorization course timings',
                        'days' => 'Monday, Tuesday, Wednesday, Thursday, and Saturday',

                        'image_url' => 'images/courselist/trbeyah/6.jpeg'
                        ,
                        'reviews' => [
                            [
                                'text' => "Alhamdulillah, I have been with Al-kahaf Academy for three years, and it is an excellent institution for learning Islamic education. All the teachers here are very good and explain everything very well to the students. Every lesson comes with a recording so that if something is not understood, one can listen to the recording. And no matter how many times you ask Bajijan, she always explains it. I am very attached to this institution, which is why I make sure to take any short courses that start here.",
                            ],
                            [
                                'text' => "I have been in this group for six months, and Alhamdulillah, I have learned a lot and have been blessed with the ability to avoid many sins.",
                            ],
                            [
                                'text' => "Alhamdulillah, this is the fourth year I am associated with this institution. This beautiful journey that started with the complete Tafseer has now reached Dars-e-Nizami Alia Awal. At every opportunity, I have always found the institution to be unique in every way. Whether it is the excellent behavior and teaching methods of the teachers or the strategies of the administration, this institution not only provides education but also works simultaneously on social behavior, ethics, and spirituality. This is a priceless treasure for online learners and an example for online education.",
                            ],
                            [
                                'text' => "I have been studying various courses at Ibrahim Academy for five years. Currently, I am in Alia Awal. Before this, I completed the Tariq ul Jannah, Tajweed, and Islah-e-Nafs courses. Ibrahim Academy is an excellent institution where the teachers teach with love. The principal's method of training is very beautiful. All the teachers teach with love and keep us connected to religion while also training us. May Allah bless this institution with great success. The best thing is that they have connected us with reciting Darood Sharif, and every 15 days, we learn a new Darood Sharif which we read with enthusiasm. May Allah accept all our actions and make them a continuous charity for our parents, our husbands, and our teachers. Ameen.",
                            ],
                            [
                                'text' => "The meaning of the hadith is that the best among you is the one who learns the Quran and teaches it. Al-kahaf Trust is fully successful in this regard. I have been associated with it for a few years, and by the grace of Allah, every day, something helps me strengthen my relationship with Allah. May Allah keep the benefits of this institution ongoing until the Day of Judgment, and may the last believer who comes till the end benefit from it. Ameen.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters Online Institute for six years. Alhamdulillah, I have completed a four-year Taleem ul Quran course, Takhassus Fil Dawah wal Irshad, and Takhassus Fil Tafseer from this institution.",
                            ],
                            [
                                'text' => "The biggest feature of this institution, which I have not seen in other institutions, is that the teaching method is the same as taught by the Prophet Muhammad (PBUH). The teachers and instructors teach with great love and affection. Besides education, special arrangements are made for training. We are guided in every aspect of life. May Allah bless the institution, and Hazrat Muhammad Ibrahim Naqshbandi and his wife, and all the organizers and assistants with more acceptance. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah! 5/6 years ago, I bloomed as a tiny flower in the garden of Al-kahaf, where there is excellent arrangement for education and training. The sincere teachers with love and hard work turn the students into gold. I have never found such an institution until now. May Allah protect it from evil eyes. Ameen.",
                            ],
                            [
                                'text' => "I have seen many gardens, but none like Al-kahaf, where love, affection, respect, and honor are blended with an atmosphere of belonging. The teachers and instructors embody the practical example of 'You are the best nation.' They tirelessly work day and night to adorn students with knowledge and refine them without any hesitation. It feels like the era of the Companions has returned, where the seekers of knowledge strive on the path of righteousness.",
                            ],
                            [
                                'text' => "I have been associated with E Al-kahaf for Sisters for two years. Alhamdulillah, when I was first introduced to E Al-kahaf for Sisters in Khasah Thani, I saw it as a new world I was not familiar with. I studied the first year in a madrasa and came from a religious family, but the zeal to act that I found here was not seen elsewhere. By the grace of Allah, I am now a student of Alia Awal. Alia Awal has breathed a new spirit into me. In this journey of connecting with the Lord, the institution has helped me immensely. I can only say:
                                    This cradle of knowledge and skill,
                                    This masterpiece of history,
                                    Every flower here is a flame,
                                    Every cypress here is a minaret.
                                May Allah grant great reward to Hazrat Aqdas Pir Zulfiqar Ahmad Naqshbandi and his authorized successor Hazrat Maulana Ibrahim Ahmad Naqshbandi, and keep their shadow long-lasting. Ameen.",
                            ],
                            [
                                'text' => "It was the time of COVID, and there was an atmosphere of fear and panic everywhere. Everyone was busy in prayers. During the blessed month of Ramadan, Allah the Almighty listened to our prayer and connected us with Al-kahaf.
                                In this turbulent era, finding Al-kahaf was like finding the cave of Surah kahaf. Alhamdulillah! After the Quranic recitation course, I did short Tajweed courses and then entered Tariq ul Jannah. Tariq ul Jannah proved to be the best path to Paradise, and from there, I was accepted as a student of the great Dars-e-Nizami course. Now I am a student of Khasah Thani. Alhamdulillah.",
                            ],
                            [
                                'text' => "I have been associated with the institution for 4 years, Alhamdulillah. I have never found such an online institution until now. The sincerity of the teachers is beyond words. Currently, I am a student of the Quranic Arabic course. The kind teachers always guide us to solve every difficulty, and we are supported in every way, Alhamdulillah! Along with studies, a lot of effort is put into training, Alhamdulillah! Many workshops and sessions on the life of the Prophet Muhammad (PBUH) are also organized for us. May Allah reward our teachers immensely. May Allah grant great progress to this institution. Ameen.",
                            ],
                            [
                                'text' => "Alhamdulillah, I have been associated with Al-kahaf for the past 7 years. By the grace of Allah, I have completed the Taleem ul Quran translation and Tafseer course and many other courses here. I have learned how to become a good and better person from here. For spiritual reform, Al-kahaf is truly the cave of Surah kahaf.",
                            ],
                            [
                                'text' => "Baji, I have been associated with this institution for 2-3 years. MashaAllah, it is a very excellent institution. I have had the opportunity to learn a lot from this institution and have applied it. Currently, I am under training in the Seerah of the Prophet Muhammad (PBUH) and Masnoon Duas.",
                            ],
                        ],
                    ],
                ],
            ],
        ];
        
        if ($classname === null) {
            // Handle the case where no class name is provided in the URL
            return view('error', ['error' => 'Class name not provided.']);
        }

        $classDetails = null;
        foreach ($courseData as $course) {
            foreach ($course['classes'] as $class) {
                if ($class['class_name'] == $classname) {
                    $classDetails = $class;
                    break 2; // Break both loops on finding the class
                }
            }
        }

        // Check if class details found for the provided ID
        if (!$classDetails) {
            // Handle 404 error: return appropriate view with error message
            return view('error', ['error' => 'Class not found.']);
        }

        // Extracting class names
        $classNames = collect($courseData)->flatMap(function ($course) {
            return collect($course['classes'])->pluck('class_name');
        })->take(10)->all();

        return view('engcourselist', [
            'classes' => collect($courseData)->flatMap(function ($course) {
                return $course['classes'];
            })->all(), // Pass all classes as $classes
            'classNames' => $classNames,
            'classDetails' => $classDetails,
        ]);
    }
} ?>